Repository: realnghon/chatmcp
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Settings
tr: Ayarlar

source: General
tr: Genel

source: Providers
tr: Sağlayıcılar

source: MCP Server
tr: MCP Sunucusu

source: Language
tr: Dil

source: Theme
tr: Tema

source: Dark
tr: Koyu

source: Light
tr: Açık

source: System
tr: Sistem

source: Language Settings
tr: Dil Ayarları

source: Feature Settings
tr: Özellik Ayarları

source: Enable Artifacts
tr: Artifact'leri Etkinleştir

# enableArtifactsDescription
source: Enable the artifacts of the AI assistant in the conversation, will use more tokens
tr: Sohbette yapay zeka asistanının Artifact'lerini etkinleştirir, bu özellik daha fazla token kullanır.

source: Enable Tool Usage
tr: Araç Kullanımını Etkinleştir

# enableToolUsageDescription
source: Enable the usage of tools in the conversation, will use more tokens
tr: Sohbette araçların kullanımını etkinleştirir, bu özellik daha fazla token kullanır.

source: Theme Settings
tr: Tema Ayarları

source: Light Theme
tr: Açık Tema

source: Dark Theme
tr: Koyu Tema

source: Follow System
tr: Sistem Ayarlarına Uygula

source: Show Avatar
tr: Avatar Gösterimi

source: Show Assistant Avatar
tr: Asistan Avatarını Göster

# showAssistantAvatarDescription
source: Show the avatar of the AI assistant in the conversation
tr: Sohbette yapay zeka asistanının avatarını gösterir.

source: Show User Avatar
tr: Kullanıcı Avatarını Göster

# showUserAvatarDescription
source: Show the avatar of the user in the conversation
tr: Sohbette kullanıcının avatarını gösterir.

source: System Prompt
tr: Sistem Prompt

# systemPromptDescription
source: This is the system prompt for the conversation with the AI assistant, used to set the behavior and style of the assistant
tr: Bu, yapay zeka asistanının davranışını ve tarzını belirlemek için kullanılan sistem yönergesidir.

source: LLM Key
tr: LLM Anahtarı

source: Tool Key
tr: Araç Anahtarı

source: Save Settings
tr: Ayarları Kaydet

source: API Key
tr: API Anahtarı

# enterApiKey
source: Enter your {provider} API Key
tr: {provider} API Anahtarınızı Girin

# apiKeyValidation
source: API Key must be at least 10 characters
tr: API Anahtarı en az 10 karakter olmalıdır.

source: API Endpoint
tr: API Uç Noktası

# enterApiEndpoint
source: Enter API endpoint URL
tr: API uç noktası URL'sini girin

source: API Version
tr: API Versiyonu

source: Enter API Version
tr: API versiyonunu girin

# platformNotSupported
source: Current platform does not support MCP Server
tr: Mevcut platform MCP Sunucusunu desteklemiyor.

# mcpServerDesktopOnly
source: MCP Server only supports desktop platforms (Windows, macOS, Linux)
tr: MCP Sunucusu yalnızca masaüstü platformlarını (Windows, macOS, Linux) destekler.

source: Search server...
tr: Sunucu ara...

# noServerConfigs
source: No server configurations found
tr: Sunucu yapılandırması bulunamadı.

source: Add Provider
tr: Sağlayıcı Ekle

source: Refresh
tr: Yenile

source: Install
tr: Yükle

source: Edit
tr: Düzenle

source: Delete
tr: Sil

# command
source: Command Or Sever Url
tr: Komut veya Sunucu Adresi

source: Arguments
tr: Argümanlar

source: Environment Variables
tr: Ortam Değişkenleri

source: Server Name
tr: Sunucu Adı

# commandExample
source: For example: npx, uvx, https://mcpserver.com
tr: Örneğin: npx, uvx, https://mcpserver.com

# argumentsExample
source: Separate arguments with spaces, use quotes for arguments with spaces, for example: -y obsidian-mcp '/Users/username/Documents/Obsidian Vault'
tr: Argümanları boşlukla ayırın. Boşluk içerenler için tırnak işareti kullanın, örn: -y obsidian-mcp '/Kullanıcılar/kullaniciadi/Belgeler/Obsidian Kasası'

# envVarsFormat
source: One per line, format: KEY=VALUE
tr: Her satıra bir tane, ANAHTAR=DEĞER formatında

source: Cancel
tr: İptal

source: Save
tr: Kaydet

source: Confirm Delete
tr: Silmeyi Onayla

# confirmDeleteServer
source: Are you sure you want to delete server "{name}" ?
tr: "{name}" adlı sunucuyu silmek istediğinize emin misiniz?

source: Error
tr: Hata

# commandNotExist
source: Command "{command}" does not exist, please install it first Current PATH: {path}
tr: "{command}" komutu bulunamadı. Lütfen önce bu komutu yükleyin. Mevcut PATH: {path}

source: All
tr: Tümü

source: Installed
tr: Yüklü

source: Model Settings
tr: Model Ayarları

# temperatureTooltip
source: Sampling temperature controls the randomness of output: • 0.0: Suitable for code generation and math problems • 1.0: Suitable for data extraction and analysis • 1.3: Suitable for general conversation and translation • 1.5: Suitable for creative writing and poetry
tr: Temperature , çıktının rastgeleliğini kontrol eder: • 0.0: Kod üretimi ve matematiksel problemler için idealdir. • 1.0: Veri çıkarma ve analiz için uygundur. • 1.3: Genel sohbet ve çeviri için uygundur. • 1.5: Yaratıcı yazarlık ve şiir için harikadır.

# topP
source: Top P: {value}
tr: Çekirdek Örnekleme (Top P): {value}

# topPTooltip
source: Top P (nucleus sampling) is an alternative to temperature. The model only considers tokens whose cumulative probability exceeds P. It is recommended not to modify both temperature and top_p at the same time.
tr: Top P (Çekirdek Örnekleme), sıcaklık parametresine bir alternatiftir. Model, yalnızca kümülatif olasılığı P'yi aşan token'ları dikkate alır. Sıcaklık ve top_p değerlerini aynı anda değiştirmeniz önerilmez.

source: Max Tokens
tr: Maksimum Token

# maxTokensTooltip
source: Maximum number of tokens to generate. One token is approximately equal to 4 characters. Longer conversations require more tokens.
tr: Üretilecek maksimum token sayısı. Bir token yaklaşık 4 karaktere eşittir. Daha uzun sohbetler daha fazla token gerektirir.

# frequencyPenalty
source: Frequency Penalty: {value}
tr: Frequency Cezası: {value}

# frequencyPenaltyTooltip
source: Frequency penalty parameter. Positive values penalize new tokens based on their existing frequency in the text, decreasing the model's likelihood of repeating the same content verbatim.
tr: Frequency cezası parametresi. Pozitif değerler, metindeki mevcut frekanslarına göre yeni token'ları cezalandırarak modelin aynı içeriği kelimesi kelimesine tekrarlama olasılığını azaltır.

# presencePenalty
source: Presence Penalty: {value}
tr: Presence Cezası: {value}

# presencePenaltyTooltip
source: Presence penalty parameter. Positive values penalize new tokens based on whether they appear in the text, increasing the model's likelihood of talking about new topics.
tr: Presence cezası parametresi. Pozitif değerler, metinde daha önce geçip geçmediklerine göre yeni token'ları cezalandırarak modelin yeni konular hakkında konuşma olasılığını artırır.

source: Enter max tokens
tr: Maksimum token sayısını girin

source: Share
tr: Paylaş

source: Model Config
tr: Model Ayarları

source: Debug
tr: Debug Modu

source: Web Search Test
tr: Web Araması Testi

source: Today
tr: Bugün

source: Yesterday
tr: Dün

source: Last 7 Days
tr: Son 7 Gün

source: Last 30 Days
tr: Son 30 Gün

source: Earlier
tr: Daha Eski

# confirmDeleteSelected
source: Are you sure you want to delete the selected conversations?
tr: Seçili sohbetleri silmek istediğinize emin misiniz?

source: OK
tr: Tamam

source: Ask me anything...
tr: Aklındakini sor...

source: Upload Files
tr: Dosya Yükle

# welcomeMessage
source: How can I help you today?
tr: Bugün sana nasıl yardımcı olabilirim?

source: Copy
tr: Kopyala

# copied
source: Copied to clipboard
tr: Panoya kopyalandı!

source: Retry
tr: Yeniden Dene

source: Broken Image
tr: Bozuk Resim

# toolCall
source: call {name}
tr: {name} çağrılıyor

# toolResult
source: call {name} result
tr: {name} çağrısının sonucu

source: Select Model
tr: Model Seç

source: Close
tr: Kapat

source: Select from Gallery
tr: Galeriden Seç

source: Select File
tr: Dosya Seç

source: Upload File
tr: Dosya Yükle

source: Open Browser
tr: Tarayıcıda Aç

source: Code copied to clipboard
tr: Kod panoya kopyalandı.

source: Thinking
tr: Düşünüyor...

source: Thinking End
tr: Düşünme tamamlandı.

source: Tool
tr: Araç

# userCancelledToolCall
source: Tool execution failed
tr: Araç çalıştırılamadı.

source: Code
tr: Kod

source: Preview
tr: Önizleme

# functionCallAuth
source: Tool Call Authorization
tr: Araç Kullanım İzni

# allowFunctionExecution
source: Do you want to allow the following tool to execute:
tr: Aşağıdaki aracın çalışmasına izin veriyor musunuz?

# parameters
source: Parameters: {params}
tr: Parametreler: {params}

source: Allow
tr: İzin Ver

# loadContentFailed
source: Failed to load content, please retry
tr: İçerik yüklenemedi, lütfen tekrar deneyin.

# loadDiagramFailed
source: Failed to load diagram, please retry
tr: Diyagram yüklenemedi, lütfen tekrar deneyin.

source: Copied to clipboard
tr: Panoya kopyalandı.

source: Chinese
tr: Çince

source: Turkish
tr: Türkçe

# functionRunning
source: Running Tool...
tr: Araç çalıştırılıyor...

# thinkingProcess
source: Thinking
tr: Düşünme Süreci ...

# thinkingProcessWithDuration
source: Thinking, time used
tr: Düşünme, geçen süre

# thinkingEndWithDuration
source: Thinking finished, time used
tr: Düşünme tamamlandı, geçen süre

# thinkingEndComplete
source: Thinking finished
tr: Düşünme tamamlandı

# seconds
source: {seconds}s
tr: {seconds}sn

# fieldRequired
source: This field is required
tr: Bu alan zorunludur.

source: Auto Approve
tr: Otomatik Onayla

# verify
source: Verify Key
tr: Anahtarı Doğrula

source: How to get
tr: Nasıl alınır?

source: Model List
tr: Model Listesi

source: Enable Models
tr: Modelleri Etkinleştir

source: Disable All Models
tr: Tüm Modelleri Devre Dışı Bırak

# saveSuccess
source: Settings saved successfully
tr: Ayarlar başarıyla kaydedildi!

# genTitleModel
source: Gen Title
tr: Başlık Oluşturma Modeli

# serverNameTooLong
source: Server name cannot exceed 50 characters
tr: Sunucu adı 50 karakterden uzun olamaz.

source: Server Type
tr: Sunucu Türü

source: Reset
tr: Sıfırla

source: Start
tr: Başlat

source: stop
tr: Durdur

source: Search
tr: Ara

# newVersionFound
source: New version {version} available
tr: Yeni bir {version} sürümü mevcut!

source: New version available
tr: Yeni Sürüm Mevcut

source: Update Now
tr: Şimdi Güncelle

source: Update Later
tr: Daha Sonra

source: Ignore This Version
tr: Bu Sürümü Atla

source: Release Notes:
tr: Sürüm Notları:

# openUrlFailed
source: Failed to open URL
tr: Bağlantı açılamadı.

source: Checking for updates...
tr: Güncellemeler kontrol ediliyor...

# checkUpdate
source: Update Check
tr: Güncellemeleri Kontrol Et

# appDescription
source: ChatMCP is a cross-platform AI client, dedicated to making AI accessible to more people.
tr: ChatMCP, yapay zekayı daha fazla insana ulaştırmayı hedefleyen, platformlar arası bir yapay zeka istemcisidir.

# visitWebsite
source: website
tr: Web Sitesi

# aboutApp
source: About
tr: Hakkında

# networkError
source: Network error occurred
tr: Ağ bağlantı hatası. Lütfen internetinizi kontrol edip tekrar deneyin.

# noElementError
source: No element found
tr: Eşleşen içerik bulunamadı, lütfen tekrar deneyin.

# permissionError
source: Permission denied
tr: Yetersiz izin. Lütfen ayarlarınızı kontrol edin.

# unknownError
source: Unknown error occurred
tr: Bilinmeyen bir hata oluştu.

# timeoutError
source: Request timed out
tr: İstek zaman aşımına uğradı. Lütfen bir süre sonra tekrar deneyin.

# notFoundError
source: Resource not found
tr: İstenen kaynak bulunamadı.

# invalidError
source: Invalid request
tr: Geçersiz istek veya parametre.

# unauthorizedError
source: Unauthorized access
tr: Yetkisiz erişim. Lütfen izinlerinizi kontrol edin.

source: Minimize
tr: Küçült

source: Maximize
tr: Büyüt

source: Conversation Settings
tr: Sohbet Ayarları

source: Max Messages
tr: Maksimum Mesaj Sayısı

# maxMessagesDescription
source: Limit the maximum number of messages passed to LLM (1-1000)
tr: LLM'e gönderilecek maksimum mesaj sayısını sınırlar (1-1000).

source: Max Loops
tr: Maksimum Döngü Sayısı

# maxLoopsDescription
source: Limit the maximum number of tool call loops to prevent infinite loops (1-1000)
tr: Sonsuz döngüleri önlemek için araç çağırma döngü sayısını sınırlar (1-1000).

source: MCP Servers
tr: MCP Sunucuları

source: Get API Key
tr: API Anahtarı Al

source: Opening browser
tr: Tarayıcı açılıyor...

source: Confirm
tr: Onayla

source: Provider Name
tr: Sağlayıcı Adı

source: API Style
tr: API Tarzı

source: Enter provider name
tr: Sağlayıcı adını girin

# providerNameRequired
source: Provider name is required
tr: Sağlayıcı adı zorunludur.

source: Add Model
tr: Model Ekle

source: Model Name
tr: Model Adı

source: Enter model name
tr: Model adını girin

# noApiConfigs
source: No API configurations available
tr: Kullanılabilir API yapılandırması yok.

source: Add
tr: Ekle

source: Fetch
tr: Getir

source: ON
tr: AÇIK

source: OFF
tr: KAPALI

source: API URL
tr: API Adresi

# selectApiStyle
source: Please select API style
tr: Lütfen bir API tarzı seçin

source: Proxy Settings
tr: Proxy Ayarları

source: Enable Proxy
tr: Proxy'yi Etkinleştir

# enableProxyDescription
source: When enabled, network requests will go through the configured proxy server
tr: Etkinleştirildiğinde, ağ istekleri yapılandırılan proxy sunucu üzerinden gidecektir

source: Proxy Type
tr: Proxy Türü

source: Proxy Host
tr: Proxy Adresi

source: Proxy Port
tr: Proxy Portu

# proxyUsername
source: Username
tr: Kullanıcı Adı

# proxyPassword
source: Password
tr: Şifre

# enterProxyHost
source: Enter proxy server address
tr: Proxy sunucu adresini girin

source: Enter proxy port
tr: Proxy portunu girin

# enterProxyUsername
source: Enter username (optional)
tr: Kullanıcı adını girin (isteğe bağlı)

# enterProxyPassword
source: Enter password (optional)
tr: Şifreyi girin (isteğe bağlı)

# proxyHostRequired
source: Proxy host is required
tr: Proxy adresi zorunludur

# proxyPortInvalid
source: Proxy port must be between 1-65535
tr: Proxy portu 1-65535 arasında olmalıdır

source: Saved
tr: Kaydedildi

source: Data Sync
tr: Veri Senkronizasyonu:

# syncServerRunning
source: Sync server is running
tr: Senkronizasyon sunucusu çalışıyor

source: Sync server stopped
tr: Senkronizasyon sunucusu durduruldu

# scanQRToConnect
source: Other devices scan this QR code to connect:
tr: Diğer cihazlar bağlanmak için bu QR kodu tarayabilir:

# addressCopied
source: Address copied to clipboard
tr: Adres panoya kopyalandı

# otherDevicesCanScan
source: Other devices can scan this QR code to connect quickly
tr: Diğer cihazlar hızlı bağlantı için bu QR kodu tarayabilir

source: Start Server
tr: Sunucuyu Başlat

source: Stop Server
tr: Sunucuyu Durdur

source: Connect to Other Devices
tr: Diğer Cihazlara Bağlan

# scanQRCode
source: Scan QR Code to Connect
tr: QR Kod Tarayarak Bağlan

source: Connection History:
tr: Bağlantı Geçmişi:

source: Connect
tr: Bağlan

# manualInputAddress
source: Or manually enter server address:
tr: Veya sunucu adresini manuel olarak girin:

source: Server Address
tr: Sunucu Adresi

source: Sync from Server
tr: Sunucudan Senkronize Et

source: Push to Server
tr: Sunucuya Gönder

source: Usage Instructions
tr: Kullanım Talimatları

source: Desktop as Server:
tr: Masaüstü Sunucu Olarak:

# desktopStep1
source: 1. Click "Start Server" button
tr: 1. "Sunucuyu Başlat" düğmesine tıklayın

# desktopStep2
source: 2. Show QR code for mobile to scan
tr: 2. Mobil cihazın taraması için QR kodu gösterin

# desktopStep3
source: 3. Mobile can sync data after scanning
tr: 3. Mobil cihaz tarama sonrası veri senkronizasyonu yapabilir

# mobileConnect
source: Mobile Connection:
tr: Mobil Bağlantı:

# mobileStep1
source: 1. Click "Scan QR Code to Connect"
tr: 1. "QR Kod Tarayarak Bağlan" düğmesine tıklayın

# mobileStep2
source: 2. Scan the QR code displayed on desktop
tr: 2. Masaüstünde gösterilen QR kodu tarayın

# mobileStep3
source: 3. Choose sync direction (upload/download)
tr: 3. Senkronizasyon yönünü seçin (yükleme/indirme)

# uploadDescription
source: • Upload: Push local device data to server
tr: • Yükleme: Yerel cihaz verilerini sunucuya gönder

# downloadDescription
source: • Download: Get data from server to local device
tr: • İndirme: Sunucudan yerel cihaza veri al

# syncContent
source: • Sync Content: Chat history, settings, MCP configs
tr: • Senkronizasyon İçeriği: Sohbet geçmişi, ayarlar, MCP yapılandırmaları

source: Sync server started
tr: Senkronizasyon sunucusu başlatıldı

# syncServerStartFailed
source: Failed to start server
tr: Sunucu başlatılamadı

# syncServerStopFailed
source: Failed to stop server
tr: Sunucu durdurulamadı

# scanQRCodeTitle
source: Scan QR Code
tr: QR Kod Tarama

source: Flash On
tr: Flaş Açık

source: Flash Off
tr: Flaş Kapalı

# aimQRCode
source: Aim the QR code at the scanning frame
tr: QR kodu tarama çerçevesine hizalayın

# scanSyncQRCode
source: Scan the sync QR code displayed on desktop
tr: Masaüstünde gösterilen senkronizasyon QR kodunu tarayın

# manualInputAddressButton
source: Manual Input Address
tr: Manuel Adres Girişi

# manualInputServerAddress
source: Manually Input Server Address
tr: Sunucu Adresini Manuel Olarak Girin

# enterValidServerAddress
source: Please enter a valid server address
tr: Lütfen geçerli bir sunucu adresi girin

# scanSuccessConnectTo
source: Scan successful, connected to: {deviceName}
tr: Tarama başarılı, bağlanıldı: {deviceName}

# scanSuccessAddressFilled
source: Scan successful, server address filled
tr: Tarama başarılı, sunucu adresi dolduruldu

# scannerOpenFailed
source: Failed to open scanner
tr: Tarayıcı açılamadı

# pleaseInputServerAddress
source: Please scan QR code or input server address first
tr: Lütfen önce QR kodu tarayın veya sunucu adresi girin

source: Connecting to server...
tr: Sunucuya bağlanıyor...

source: Downloading data...
tr: Veri indiriliyor...

source: Importing data...
tr: Veri içe aktarılıyor...

# reinitializingData
source: Reinitializing app data...
tr: Uygulama verileri yeniden başlatılıyor...

# dataSyncSuccess
source: Data sync successful
tr: Veri senkronizasyonu başarılı

source: Preparing data...
tr: Veri hazırlanıyor...

source: Uploading data...
tr: Veri yükleniyor...

# dataPushSuccess
source: Data push successful
tr: Veri gönderimi başarılı

source: Sync failed
tr: Senkronizasyon başarısız

source: Push failed
tr: Gönderim başarısız

source: Just now
tr: Az önce

# minutesAgo
source: {minutes} minutes ago
tr: {minutes} dakika önce

# hoursAgo
source: {hours} hours ago
tr: {hours} saat önce

# daysAgo
source: {days} days ago
tr: {days} gün önce

# serverSelected
source: Server selected: {deviceName}
tr: Sunucu seçildi: {deviceName}

source: Connection record deleted
tr: Bağlantı kaydı silindi

# viewAllConnections
source: View all {count} connections
tr: Tüm {count} bağlantıyı görüntüle

# clearAllHistory
source: Clear All
tr: Tümünü Temizle

# clearAllConnectionHistory
source: All connection history cleared
tr: Tüm bağlantı geçmişi temizlendi

source: Unknown Device
tr: Bilinmeyen Cihaz

source: Unknown Platform
tr: Bilinmeyen Platform
